---
kind: type
id: T:Autodesk.Revit.DB.CurveElementType
source: html/bb7da2a1-6a68-df2a-aacb-1d90c8a0f5b7.htm
---
# Autodesk.Revit.DB.CurveElementType

An enumerated type listing the curve element types that can be used when filtering elements
 (via CurveElementFilter).

## Syntax (C#)
```csharp
public enum CurveElementType
```